Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/how_health_is_organised/health_boards.html.txt.tmx
Source language: en
Languages: ga

source: • Provision of health and personal social services
ga: • Seirbhísí sláinte agus seirbhísí sóisialta pearsanta a sholáthar

source: • Duty of HSE to provide services
ga: • Dualgas FSS chun seirbhísí a sholáthar

source: Health and personal social services are delivered by the Health Service Executive (HSE), through medical professionals and hospitals and through a network of Local Health Offices, health centres and clinics at community level
ga: Déanann Feidhmeannacht na Seirbhíse Sláinte (FSS) seirbhísí sláinte agus seirbhísí sóisialta pearsanta a sheachadadh, trí ghairmithe leighis agus ospidéil agus trí líonra Oifigí Sláinte Áitiúla, ionaid agus clinicí sláinte ag leibhéal an phobail

source: Health services can be broadly defined as those services that are concerned with the
ga: Is féidir seirbhísí sláinte a shainmhíniú go ginearálta mar sheirbhísí a bhaineann le

source: • promotion of good health
ga: • cur chun cinn na sláinte

source: • prevention of illness (for example, food safety services, immunisation and vaccinations services, health screening, infant and child health services)
ga: • breoiteacht a chosc (mar shampla, seirbhísí sábháilteachta bia, seirbhísí imdhíonachta agus vacsaínithe, scagthástáil sláinte, seirbhísí sláinte naíonán agus leanaí)

source: • the diagnosis and treatment of illness (for example, family doctor (GP) services, hospital services)
ga: • diagnóis agus cóireáil breoiteachta (mar shampla, seirbhísí an dochtúra teaghlaigh (DG), seirbhísí ospidéil)

source: Community care and personal social services can be broadly defined as those that are designed to enable people to remain living in their communities, especially when they have difficulties doing so because of illness, disability or age
ga: Is féidir seirbhísí cúram pobail agus seirbhísí sóisialta pearsanta a shainmhíniú go ginearálta mar sheirbhísí atá deartha chun cur ar chumas daoine maireachtáil ina bpobal féin, go háirithe nuair atá deacrachtaí acu de bharr breoiteachta, míchumais nó aoise

source: Examples include home nursing services, home helps, occupational therapy and social work services
ga: Áirítear leo sin seirbhísí altranais baile, cúntóirí baile, teiripe shaothair agus seirbhísí oibre sóisialta

source: Provision of health and personal social services
ga: Seirbhísí sláinte agus seirbhísí sóisialta pearsanta a sholáthar

source: The Integrated Services Directorate manages all hospital and community public health services
ga: Déanann an Stiúrthóireacht Seirbhísí Comhtháite gach seirbhís ospidéil agus sláinte poiblí pobail a bhainistiú

source: The National Director has responsibility for the delivery of all health and personal social services across the country including hospital, primary, community and continuing care services
ga: Tá an Stiúrthóir Náisiúnta freagrach as gach seirbhís sláinte agus phearsanta shóisialta a sholáthar ar fud na tíre, lena n-áirítear seirbhísí ospidéil, cúraim phríomhúil, pobail agus cúraim leantaigh

source: The range of health and personal social services provided by the HSE and its funded agencies are managed within four Regions, each with a Regional Directors of Operations
ga: Bainistítear an réimse seirbhísí sláinte agus pearsanta sóisialta a sholáthraíonn FSS agus a ngníomhaireachtaí cistithe laistigh de cheithre Réigiún, agus tá Stiúrthóirí Réigiúnacha Oibríochtaí i ngach ceann díobh

source: The main function of a HSE Administrative Area is to provide or arrange for the provision of health, community care and personal social services to the people in its area
ga: Is í príomhfheidhm an Cheantair Riaracháin FSS ná socrú nó soláthar a dhéanamh maidir le seirbhísí sláinte, cúram pobail agus sóisialta pearsanta do dhaoine sa cheantar sin

source: They provide many of the services directly and they arrange for the provision of other services by health professionals, private health service providers, voluntary hospitals and voluntary/community organisations
ga: Déanann siad go leor seirbhísí a sholáthar go díreach agus déanann siad seirbhísí eile a sholáthar trí ghairmithe sláinte, soláthraithe príobháideacha na seirbhísí sláinte, ospidéil dheonacha agus eagraíochtaí deonacha/pobail

source: The geographic areas covered by each of the Administrative Areas are;
ga: Is iad na ceantair gheografacha a chlúdaíonn gach Ceantar Riaracháin ná;

source: HSE Dublin Mid-Leinster: Dublin city south of the River Liffey, south Dublin county, Wicklow, Kildare, Longford, Westmeath, Laois, Offally
ga: FSS Baile Átha Cliath Lár-Laighean: Cathair Bhaile Átha Cliath ó dheas d’Abhainn na Life, deisceart Chontae Bhaile Átha Cliath, Cill Mhantáin, Cill Dara, an Longfort, an Iarmhí, Laois, Uíbh Fhailí

source: HSE Dublin North East: Dublin City north of the River Liffey, the community of Fingal county, Louth, Meath, Cavan, Monaghan
ga: FSS Baile Átha Cliath Thoir Thuaidh: Cathair Bhaile Átha Cliath ó thuaidh d’Abhainn na Life, pobal Contae Fhine Gall, an Lú, an Mhí, an Cabhán, Muineachán

source: HSE West: Limerick, Clare, Tipperary (North Riding), Galway, Mayo, Roscommon, Donegal, Sligo, Leitrim
ga: FSS an Iarthair: Luimneach, an Clár, Tiobraid Árann (An Trian Thuaidh), Gaillimh, Maigh Eo, Ros Comáin, Dún na nGall, Sligeach, Liatroim

source: HSE South: Carlow, Kilkenny, Tipperary (South Riding) Waterford, Wexford, Cork, Kerry
ga: FSS an Deiscirt: Ceatharlach, Cill Chainnigh, Tiobraid Árann (An Trian Theas) Port Láirge, Loch Garman, Corcaigh, Ciarraí

source: The main delivery point for community health and personal social services is through the network of 32 Local Health Offices and local health centres
ga: An príomhphointe seachadta do sheirbhísí sláinte pobail agus sóisialta pearsanta ná tríd an líonra de 32 Oifig Sláinte Áitiúil agus ionaid sláinte áitiúla

source: The wide range of services that are provided through Local Health Offices and from health centres include general practitioner services, public health nursing, child health services, community welfare, chiropody, ophthalmic, speech therapy, social work, addiction counselling and treatment, physiotherapy, occupational therapy, psychiatric services and home help
ga: I measc an raon leathan seirbhísí a sholáthraítear trí Oifigí Sláinte Áitiúla agus ó ionaid sláinte tá seirbhísí dochtúra ginearálta, altranas sláinte phobail, seirbhísí sláinte leanaí, leas pobail, cosliacht, seirbhís oftalmach, teiripe urlabhra, obair shóisialta, comhairleoireacht agus cóireáil andúile, fisiteiripe, teiripe shaothair, seirbhísí síciatracha agus cúntóir baile

source: Access to hospital services is through your GP/family doctor, except for Accident and Emergency services
ga: Déantar rochtain ar sheirbhísí ospidéil trí DG/dochtúir teaghlaigh, seachas Seirbhísí Timpistí agus Éigeandála

source: Duty of HSE to provide services
ga: Dualgas FSS chun seirbhísí a sholáthar

source: The HSE Area is obliged to provide certain services, e.g., family doctor (GP) and public hospital services
ga: Tá dualgas ar an gCeantar FSS seirbhísí áirithe a sholáthar, m.sh., dochtúir teaghlaigh (DG) agus seirbhísí ospidéil phoiblí

source: There are other services that they may provide, e.g., home helps and other community care services
ga: Tá seirbhísí eile is féidir leo a sholáthar freisin, m.sh., cúntóirí baile agus seirbhísí cúraim eile don phobal

source: A significant part of the HSE Area's overall budget is allocated to those services that are obligatory
ga: Dáiltear cuid shuntasach de bhuiséad foriomlán an Cheantair FSS ar na seirbhísí sin atá éigeantach

source: The Health Strategy recognises that all decisions whether financial or clinical must be based on the best available evidence
ga: Aithníonn an Straitéis Sláinte go gcaithfidh gach cinneadh, cibé ar chúrsaí airgeadais nó cliniciúla, a bheith bunaithe ar an bhfianaise is fearr atá ar fáil

source: Decisions will be based on:
ga: Déanfar cinntí bunaithe ar na nithe a leanas:

source: • Statistical qualitative or quantitative data
ga: • Sonraí staitistiúla go cáilíochtúil nó go cainníochtúil

source: • Other documented trends and behaviours
ga: • Treochtaí agus iompraíochtaí taifeadta eile

source: All HSE Administrative Areas must provide service plans that usually review the previous year's spending and give a detailed breakdown of how funding provided by the HSE will be spent during the year in question
ga: Caithfidh gach Ceantar Riaracháin FSS pleananna seirbhíse a sholáthar a dhéanann athbhreithniú go hiondúil ar chaiteachas na bliana roimhe sin agus a thugann miondealú sonraithe ar an mbealach a chaithfear maoiniú a sholáthair FSS i rith na bliana sin

source: The Department of Health formally sets out a statement of national priorities for health, which is then addressed by the HSE in preparing their individual service plans
ga: Leagann an Roinn Sláinte ráiteas amach go foirmiúil maidir le tosaíochtaí náisiúnta do chúrsaí sláinte, agus tugann FSS fúthu nuair atá pleananna seirbhíse aonair á n-ullmhú acu
